t21/Walnut_X/Packages/.cache/Keil.SAMD21_DFP.1.2.0.pdsc
        <!-- *************************  Device 'ATSAMD21E16B'  **************************** -->
        <device Dname="ATSAMD21E16B">
          <compile header="Device\SAMD21\Include\samd21.h" define="__SAMD21E16B__"/>
          <debug svd="SVD\SAMD21\ATSAMD21E16B.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAMD21_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E16BU'  *************************** -->
        <device Dname="ATSAMD21E16BU">
          <compile header="Device\SAMD21\Include\samd21.h" define="__SAMD21E16BU__"/>
          <debug svd="SVD\SAMD21\ATSAMD21E16B.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAMD21_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E17A'  **************************** -->
        <device Dname="ATSAMD21E17A">
          <compile header="Device\SAMD21\Include\samd21.h" define="__SAMD21E17A__"/>
          <debug svd="SVD\SAMD21\ATSAMD21E17A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAMD21_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E18A'  **************************** -->
        <device Dname="ATSAMD21E18A">
          <compile header="Device\SAMD21\Include\samd21.h" define="__SAMD21E18A__"/>
          <debug svd="SVD\SAMD21\ATSAMD21E18A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAMD21_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21G15A'  **************************** -->
        <device Dname="ATSAMD21G15A">
          <compile header="Device\SAMD21\Include\samd21.h" define="__SAMD21G15A__"/>
          <debug svd="SVD\SAMD21\ATSAMD21G15A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAMD21_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <feature type="IOs"           n="38"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="6"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="14"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="48"                          name="QFN Package"/>
          <feature type="QFP"           n="48"                          name="TQFP Package"/>
          <feature type="CSP"           n="48"                          name="WLCSP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21G15B'  **************************** -->
        <device Dname="ATSAMD21G15B">
          <compile header="Device\SAMD21\Include\samd21.h" define="__SAMD21G15B__"/>
          <debug svd="SVD\SAMD21\ATSAMD21G15B.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAMD21_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

